Autodesk.Revit.DB.Plumbing.PipePressureDropData.Viscosity
The dynamic viscosity of the pipe. Units: (kg/(ft·s)).
Since:
2014

Autodesk.Revit.DB.Plumbing.PipePressureDropData.VelocityPressure
The velocity pressure of the pipe. Units: (kg/(ft·s²)).
Since:
2014

Autodesk.Revit.DB.Plumbing.PipePressureDropData.Velocity
The velocity of the pipe. Units: (ft/s).
Since:
2014

Autodesk.Revit.DB.Plumbing.PipePressureDropData
The input and output data used by external servers for calculation of the pipe pressure drop.
Remarks:
Roughness, Length, Flow, Diameter, Density, and Viscosity field values are input data for the calculation. ReynoldsNumber, FlowStatus, Friction, FrictionFactor, Velocity, Coefficient, and PressureDrop are output values.
Since:
2014